___

<a href='http://www.pieriandata.com'> <img src='../Pierian_Data_Logo.png' /></a>
___

# DataFrames

DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

In [1]:
import pandas as pd
import numpy as np

In [2]:
from numpy.random import randn
np.random.seed(101)

In [9]:
# DataFrame is collection of Series

# randn(n,m) is use random number for n rows, m columns

# df = pd.DataFrame(randn(5,4),index=['A','B','D','D','E'],columns=['W','X','Y','Z'])

# can use .split() to make an array from string
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [10]:
df

          W         X         Y         Z
A  1.035125 -0.031160  1.939932 -1.005187
B -0.741790  0.187125 -0.732845 -1.382920
C  1.482495  0.961458 -2.141212  0.992573
D  1.192241 -1.046780  1.292765 -1.467514
E -0.494095 -0.162535  0.485809  0.392489

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [32]:
# we can grab the data from data frame by specifying column
# note that one column is a representative of one Series
# that's why we can only select column, not a row
# if we want to select row, we need to use some helper function
print(df['W'])

# print(df['A']) -> cannot select row

A    1.035125
B   -0.741790
C    1.482495
D    1.192241
E   -0.494095
Name: W, dtype: float64

In [20]:
# Pass a list of column names
df[['W','Z']]

          W         Z
A  1.035125 -1.005187
B -0.741790 -1.382920
C  1.482495  0.992573
D  1.192241 -1.467514
E -0.494095  0.392489

In [21]:
# SQL Syntax (NOT RECOMMENDED!)
df.W

A    1.035125
B   -0.741790
C    1.482495
D    1.192241
E   -0.494095
Name: W, dtype: float64

DataFrame Columns are just Series

In [22]:
type(df['W'])

pandas.core.series.Series

**Creating a new column:**

In [23]:
# Can do operation like series
df['new'] = df['W'] + df['Y']

In [24]:
df

          W         X         Y         Z       new
A  1.035125 -0.031160  1.939932 -1.005187  2.975057
B -0.741790  0.187125 -0.732845 -1.382920 -1.474635
C  1.482495  0.961458 -2.141212  0.992573 -0.658717
D  1.192241 -1.046780  1.292765 -1.467514  2.485005
E -0.494095 -0.162535  0.485809  0.392489 -0.008287

** Removing Columns**

In [28]:
# axis = 0 look at row  -> down
# axis = 1 look at column  -> right
df.drop('new',axis=1)

df.drop('B',axis = 0)

          W         X         Y         Z       new
A  1.035125 -0.031160  1.939932 -1.005187  2.975057
C  1.482495  0.961458 -2.141212  0.992573 -0.658717
D  1.192241 -1.046780  1.292765 -1.467514  2.485005
E -0.494095 -0.162535  0.485809  0.392489 -0.008287

In [194]:
# Note that drop function does not mutate the original df
# Not inplace unless specified!
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [29]:
# we can use inplace=True to mutate the original df
df.drop('new',axis=1,inplace=True)

In [30]:
df

          W         X         Y         Z
A  1.035125 -0.031160  1.939932 -1.005187
B -0.741790  0.187125 -0.732845 -1.382920
C  1.482495  0.961458 -2.141212  0.992573
D  1.192241 -1.046780  1.292765 -1.467514
E -0.494095 -0.162535  0.485809  0.392489

Can also drop rows this way:

In [31]:
df.drop('E',axis=0)

          W         X         Y         Z
A  1.035125 -0.031160  1.939932 -1.005187
B -0.741790  0.187125 -0.732845 -1.382920
C  1.482495  0.961458 -2.141212  0.992573
D  1.192241 -1.046780  1.292765 -1.467514

** Selecting Rows**

In [34]:
# can use .loc[row] to select Row
df.loc['A']

W    1.035125
X   -0.031160
Y    1.939932
Z   -1.005187
Name: A, dtype: float64

Or select based off of position instead of label

In [36]:
# use iloc[index] to select row by specify index (instead if original key)
df.iloc[2]

W    1.482495
X    0.961458
Y   -2.141212
Z    0.992573
Name: C, dtype: float64

** Selecting subset of rows and columns **

In [38]:
# Row B column Y
df.loc['B','Y']

-0.7328451475428807

In [40]:
# can select more than one row, column
# syntax is .loc[[rows],[columns]]
df.loc[['A','B'],['W','Y']]
# df.loc[['A','B'],['W','Y']]

          W         Y
A  1.035125  1.939932
B -0.741790 -0.732845

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [41]:
df

          W         X         Y         Z
A  1.035125 -0.031160  1.939932 -1.005187
B -0.741790  0.187125 -0.732845 -1.382920
C  1.482495  0.961458 -2.141212  0.992573
D  1.192241 -1.046780  1.292765 -1.467514
E -0.494095 -0.162535  0.485809  0.392489

In [42]:
df>0

       W      X      Y      Z
A   True  False   True  False
B  False   True  False  False
C   True   True  False   True
D   True  False   True  False
E  False  False   True   True

In [43]:
# if that cell False -> value in df will be NaN
df[df>0]

          W         X         Y         Z
A  1.035125       NaN  1.939932       NaN
B       NaN  0.187125       NaN       NaN
C  1.482495  0.961458       NaN  0.992573
D  1.192241       NaN  1.292765       NaN
E       NaN       NaN  0.485809  0.392489

In [48]:
df['W']>0

A     True
B    False
C     True
D     True
E    False
Name: W, dtype: bool

In [47]:
df[df['W']>0]

          W         X         Y         Z
A  1.035125 -0.031160  1.939932 -1.005187
C  1.482495  0.961458 -2.141212  0.992573
D  1.192241 -1.046780  1.292765 -1.467514

In [49]:
df[df['W']>0]['Y']

A    1.939932
C   -2.141212
D    1.292765
Name: Y, dtype: float64

In [57]:
# if we need to select multiple columns -> make sure that put [] cover
# df[df['W']>0][['X','Y']]
df[df['W']>0][['Y','X']]

          Y         X
A  1.939932 -0.031160
C -2.141212  0.961458
D  1.292765 -1.046780

For two conditions you can use | and & with parenthesis:

In [61]:
# make sure to cver condition with parenthese
df[(df['W'] > 0) & (df['Y'] > 1)]
# df[(df['W']>0) & (df['Y'] > 1)]

          W        X         Y         Z
A  1.035125 -0.03116  1.939932 -1.005187
D  1.192241 -1.04678  1.292765 -1.467514

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [62]:
df

          W         X         Y         Z
A  1.035125 -0.031160  1.939932 -1.005187
B -0.741790  0.187125 -0.732845 -1.382920
C  1.482495  0.961458 -2.141212  0.992573
D  1.192241 -1.046780  1.292765 -1.467514
E -0.494095 -0.162535  0.485809  0.392489

In [64]:
# Reset to default 0,1...n index
# note that index is representative of row
# reset_index() will change our index into numberical index
df.reset_index()

  index         W         X         Y         Z
0     A  1.035125 -0.031160  1.939932 -1.005187
1     B -0.741790  0.187125 -0.732845 -1.382920
2     C  1.482495  0.961458 -2.141212  0.992573
3     D  1.192241 -1.046780  1.292765 -1.467514
4     E -0.494095 -0.162535  0.485809  0.392489

In [65]:
newind = 'CA NY WY OR CO'.split()

In [66]:
df['States'] = newind
# df['States'] = newind

In [67]:
df

          W         X         Y         Z States
A  1.035125 -0.031160  1.939932 -1.005187     CA
B -0.741790  0.187125 -0.732845 -1.382920     NY
C  1.482495  0.961458 -2.141212  0.992573     WY
D  1.192241 -1.046780  1.292765 -1.467514     OR
E -0.494095 -0.162535  0.485809  0.392489     CO

In [68]:
# set the
df.set_index('States')

               W         X         Y         Z
States
CA      1.035125 -0.031160  1.939932 -1.005187
NY     -0.741790  0.187125 -0.732845 -1.382920
WY      1.482495  0.961458 -2.141212  0.992573
OR      1.192241 -1.046780  1.292765 -1.467514
CO     -0.494095 -0.162535  0.485809  0.392489

In [215]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [216]:
df.set_index('States',inplace=True)

In [218]:
df

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

## Multi-Index and Index Hierarchy

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

In [253]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [254]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [257]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1  0.153661  0.167638
   2 -0.765930  0.962299
   3  0.902826 -0.537909
G2 1 -1.549671  0.435253
   2  1.259904 -0.447898
   3  0.266207  0.412580

Now let's show how to index this! For index hierarchy we use df.loc[], if this was on the columns axis, you would just use normal bracket notation df[]. Calling one level of the index returns the sub-dataframe:

In [260]:
df.loc['G1']

          A         B
1  0.153661  0.167638
2 -0.765930  0.962299
3  0.902826 -0.537909

In [263]:
df.loc['G1'].loc[1]

A    0.153661
B    0.167638
Name: 1, dtype: float64

In [265]:
df.index.names

FrozenList([None, None])

In [266]:
df.index.names = ['Group','Num']

In [267]:
df

                  A         B
Group Num
G1    1    0.153661  0.167638
      2   -0.765930  0.962299
      3    0.902826 -0.537909
G2    1   -1.549671  0.435253
      2    1.259904 -0.447898
      3    0.266207  0.412580

In [270]:
df.xs('G1')

            A         B
Num
1    0.153661  0.167638
2   -0.765930  0.962299
3    0.902826 -0.537909

In [271]:
df.xs(['G1',1])

A    0.153661
B    0.167638
Name: (G1, 1), dtype: float64

In [273]:
df.xs(1,level='Num')

              A         B
Group
G1     0.153661  0.167638
G2    -1.549671  0.435253

# Great Job!